app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    task_id = params[:id].to_i
    @task = Task.all.find_by(id: task_id)

INSERT INTO "tasks" ("action", "created_at", "updated_at", "completed_date") VALUES ($1, $2, $3, $4) RETURNING "id"  [["action", "FINISH TASK LIST"], ["created_at", "2018-09-21 00:04:00.651107"], ["updated_at", "2018-09-21 00:04:00.651107"], ["completed_date", "2018-09-20"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "action" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["action", "does this work"], ["updated_at", "2018-09-26 23:31:33.115395"], ["id", 1]]
---
    task = Task.find(params[:id])
    result = task.update(task_params)